app/Controllers/Berita.php

SELECT `opd_nama`, `opd_kode`
FROM `ms_opd`
---
    public function listOPD()
    {
        $data = [
            'listopd' => $this->opdModel->select('opd_nama, opd_kode')->findAll(),
            'pager' => $this->opdModel->pager,
            'users' => $this->users
        ];