app/Controllers/Laporan.php

SELECT `opd_nama`, `opd_kode`
FROM `ms_opd`
---
    public function listOPD()
    {
        $data = [
            'users' => $this->users,
            'listopd' => $this->opdModel->select('opd_nama, opd_kode')->findAll(),