app/Models/BeritaModel.php

SELECT COUNT(`berita_id`) AS `berita_id`
FROM `tr_berita`
JOIN `ms_users` ON `tr_berita`.`created_by`=`ms_users`.`users_nip`
WHERE `users_opd_kode` = '002'
---
    public function getTotalBerita($users_opd_kode)
    {
        return
            $this->join('ms_users', 'tr_berita.created_by=ms_users.users_nip')
            ->where(['users_opd_kode' => $users_opd_kode])
            ->selectCount('berita_id')->get();