app/Models/OPDModel.php

    public function getOPD($opd_kode = false)
    {
        if ($opd_kode == false) {
            return $this->orderBy('opd_kode')->findAll();
---
SELECT *
FROM `ms_opd`
ORDER BY `opd_kode`