app/Models/OpsiModel.php

    public function getOpsi($opsi_id = false)
    {
        if ($opsi_id == false) {
            return $this->findAll();
---
SELECT *
FROM `ms_opsi`