app/Models/RespondenModel.php

SELECT COUNT(`responden_id`) AS `responden_id`
FROM `ms_responden`
JOIN `tr_respondensurvey` ON `tr_respondensurvey`.`respondensurvey_responden_id`=`ms_responden`.`responden_id`
JOIN `tr_survey` ON `tr_survey`.`survey_id`=`tr_respondensurvey`.`respondensurvey_survey_id`
JOIN `ms_users` ON `ms_users`.`users_nip`=`tr_survey`.`created_by`
WHERE `users_opd_kode` = '002'
---
    public function getTotalResponden($opd_kode)
    {
        return
            $this
            ->selectCount('responden_id')
            ->join('tr_respondensurvey', 'tr_respondensurvey.respondensurvey_responden_id=ms_responden.responden_id')
            ->join('tr_survey', 'tr_survey.survey_id=tr_respondensurvey.respondensurvey_survey_id')
            ->join('ms_users', 'ms_users.users_nip=tr_survey.created_by')
            ->where('users_opd_kode', $opd_kode)
            ->get();

SELECT `survey_tahun` as `tahun_survey`, COUNT(`responden_id`) AS `total_respon`
FROM `ms_responden`
JOIN `tr_respondensurvey` ON `tr_respondensurvey`.`respondensurvey_responden_id`=`ms_responden`.`responden_id`
JOIN `tr_survey` ON `tr_survey`.`survey_id`=`tr_respondensurvey`.`respondensurvey_survey_id`
JOIN `ms_users` ON `ms_users`.`users_nip`=`tr_survey`.`created_by`
WHERE `users_opd_kode` = '002'
GROUP BY `survey_tahun`
ORDER BY `survey_tahun` ASC
---
    public function getTotalRespondenPerTahun($opd_kode)
    {
        return
            $this
            ->select('survey_tahun as tahun_survey')
            ->join('tr_respondensurvey', 'tr_respondensurvey.respondensurvey_responden_id=ms_responden.responden_id')
            ->join('tr_survey', 'tr_survey.survey_id=tr_respondensurvey.respondensurvey_survey_id')
            ->join('ms_users', 'ms_users.users_nip=tr_survey.created_by')
            ->where('users_opd_kode', $opd_kode)
            ->groupBy('survey_tahun')
            ->selectCount('responden_id', 'total_respon')
            ->orderBy('survey_tahun', 'ASC')
            ->get()
            ->getResultArray();