app/Models/SurveyModel.php

SELECT *
FROM `tr_survey`
JOIN `ms_users` ON `tr_survey`.`created_by`=`ms_users`.`users_nip`
WHERE `users_opd_kode` = '002'
ORDER BY `created_at`
---
    public function getSurveyByUsers($users_opd_kode = null)
    {
        if (session()->get('users_role_id') == 1) {
            return
                $this->orderBy('created_at')->get()->getResultArray();
        } else {
            return
                $this
                ->join('ms_users', 'tr_survey.created_by=ms_users.users_nip')
                ->where(['users_opd_kode' => $users_opd_kode])
                ->orderBy('created_at')
                ->get()->getResultArray();

SELECT COUNT(`survey_id`) AS `survey_id`
FROM `tr_survey`
JOIN `ms_users` ON `tr_survey`.`created_by`=`ms_users`.`users_nip`
WHERE `users_opd_kode` = '002'
---
    public function getTotalSurvey($users_opd_kode)
    {
        return
            $this->join('ms_users', 'tr_survey.created_by=ms_users.users_nip')
            ->where(['users_opd_kode' => $users_opd_kode])
            ->selectCount('survey_id')->get();

SELECT `survey_tahun`
FROM `tr_survey`
JOIN `ms_users` ON `tr_survey`.`created_by`=`ms_users`.`users_nip`
WHERE `users_opd_kode` = '002'
GROUP BY `survey_tahun`
---
    public function getSurveyTahunByUsers($users_opd_kode)
    {
        return
            $this
            ->select('survey_tahun')
            ->join('ms_users', 'tr_survey.created_by=ms_users.users_nip')
            ->groupBy('survey_tahun')
            ->where(['users_opd_kode' => $users_opd_kode])
            ->get()->getResultArray();