app/Models/UsersModel.php

    public function getUsers($users_nip = false)
    {
        if ($users_nip == false) {
            return $this->orderBy('users_nip')->findAll();
        }
        return
            $this
            ->join('ms_role', 'ms_users.users_role_id=ms_role.role_id')
            ->join('ms_opd', 'ms_users.users_opd_kode=ms_opd.opd_kode')
            ->where(['users_nip' => $users_nip])
            ->first();
---
SELECT *
FROM `ms_users`
ORDER BY `users_nip`
SELECT *
FROM `ms_users`
JOIN `ms_role` ON `ms_users`.`users_role_id`=`ms_role`.`role_id`
JOIN `ms_opd` ON `ms_users`.`users_opd_kode`=`ms_opd`.`opd_kode`
WHERE `users_nip` = '123456798'
 LIMIT 1